'''
序列是指：内容连续、有序，可使用下标索引的一类数据容器(查)
切片：从一个序列中，取出一个子序列

语法：序列［起始下标：结束下标：步长］

表示从序列中，从指定位置开始，依次取出元素，到指定位置结束，得到一个新序列：
• 起始下标表示从何处开始，可以留空，留空视作从头开始
• 结束下标（不含）表示何处结束，可以留空，留空视作截取到结尾
• 步长表示，依次取元素的间隔
• 步长1表示，一个个取元素
• 步长2表示，每次跳过1个元素取
• 步长N表示，每次跳过N-1个元素取
• 步长为负数表示，反向取（注意，起始下标和结束下标也要反向标记）

注意，此操作不会影响序列本身，而是会得到一个新的序列（列表、元組、字符串）元组和字符串不可变数据类型 这些都是序列 只要可以查就是序列 因为可以查就代表有顺序
'''
### 对list进行切片
my_list = [0,1,2,3,4,5,6]
my_list[1:4] = [2,3,4,5]# 可更改
my_list[1:4:2]
my_list[-1::-1]
my_list[-4::1]

### tuple切片
my_tuple = (0,1,2,3,4,5,6)
my_tuple[:] = (1,2,3,4,5,6,7)# TypeError: 'tuple' object does not support item assignment
my_tuple[-2:]
my_tuple[-1::-2]

### str切片
my_str = 'itheima'
my_str[0:5:2]
my_str[::-1]