### 字典类似集合 不能重复 不能索引 但是一样可以修改
### 字典中增
score = {
    '王力宏':{
        '语文':99,
        '数学':100,
        '英语':100},
    '周杰伦':{
        '语文':19,
        '数学':20,
        '英语':100
    },
    '林俊杰':{
        '语文':100,
        '数学':100,
        '英语':100
    }
}
score['张学友'] = {
        '语文':100,
        '数学':100,
        '英语':100
    }
print(score)
### 字典中更新
score['张学友'] = {
        '语文':50,
        '数学':100,
        '英语':100
    }
print(score)
### 使用pop删除指定的key 返回被删除的
score.pop('周杰伦')
print(score)

### 清空字典 clear
score.clear()

### 获取全部key keys()
score = {
    '王力宏':{
        '语文':99,
        '数学':100,
        '英语':100},
    '周杰伦':{
        '语文':19,
        '数学':20,
        '英语':100
    },
    '林俊杰':{
        '语文':100,
        '数学':100,
        '英语':100
    }
}
keys = score.keys()

### 拿到keys之后可以用来遍历 通过获取key遍历
for i in score.keys():
    print(f"字典的keys是{i}")
    print(f"字典的值是{score[i]}")
    
### 直接对字典进行for循环 每一次循环都是取的key
for i in score:
    print(f"字典的keys是{i}")
    print(f"字典的值是{score[i]}")

### while 不支持下标索引因此不能使用while循环这一点类似set
len(score)### 元素数量就是键值对 因为元素是键值对