### 先建立一份文本文件
with open('./txt/bill.txt',mode='w',encoding='utf-8') as f:
    f.write('周杰轮，2022-01-01,100000，消费，正式\n周杰轮，2022-01-02, 300000，收入，正式\n周杰轮，2022-01-03,100000，消费，测试\n林俊节，2022-01-01,300000，收入，正式\n林俊节，2022-01-02,100000，消费，测试\n林俊节，2022-01-03,100000，消费，正式\n林俊节，2022-01-04,100000，消费，测试\n林俊节，2022-01-05,500000，收入，正式\n张学油，2022-01-01,100000，消费，正式\n张学油，2022-01-02,500000，收入，正式\n张学油，2022-01-03,900000，收入，测试\n王力鸿，2022-01-01, 500000，消费，正式\n王力鸿，2022-01-02,300000，消费，测试\n王力鸿，2022-01-03, 950000，收入，正式\n刘德滑，2022-01-01,300000，消费，测试\n刘德滑，2022-01-02,100000，消费，正式\n刘德滑，2022-01-03, 300000，消费，正式')
    # f.flush()
### 
'''
• 读取文件
• 将文件写出到bil1.txt.bak文件作备份
• 同时，将文件内标记为测试的数据行丢
'''
with open('./txt/bill.txt',mode='r',encoding='utf-8') as f:
    l = open('./txt/bill.txt.bak.txt',mode='w',encoding='utf-8')
    for lines in f:
        if '测试' not in lines:
            l.write(lines)### 不会重新覆盖 只有再次open且是w模式清空 可以一直在内存中写
            # l.write('\n')
        l.flush() 

### 这样也可以相当于一直在内存写 先不刷新 最后再刷新
with open('./txt/bill.txt',mode='r',encoding='utf-8') as f:
    l = open('./txt/bill.txt.bak.txt',mode='w',encoding='utf-8')
    for lines in f:
        if '测试' not in lines:
            l.write(lines)### 不会重新覆盖 只有再次open且是w模式清空 可以一直在内存中写
            # l.write('\n')
    l.flush() 
